#include <iostream>
#include <cmath>

int main() {
    // Оголошення змінної для зберігання тризначного числа
    int Number;

    // Ввід тризначного числа від користувача
    std::cout << "Введіть тризначне число: ";
    std::cin >> Number;

    // Перевірка на те, чи введене число є тризначним
    if (Number < 100 || Number > 999) {
        std::cout << "Введене число не є тризначним.\n";
        return 0; // Повертаємо 0, що вказує на помилку
    }

    // Визначення одиниць, десятків і сотень
    int units = Number % 10;
    int tens = (Number / 10) % 10;
    int hundreds = Number / 100;

    // Вивід числа, отриманого при прочитанні вихідного числа справа наліво
    std::cout << "Число, прочитане справа наліво: " << units << tens << hundreds << std::endl;




    // Оголошення змінних для координат точки
    double x, y;

    // Ввід координат точки від користувача
    std::cout << "Введіть координату x: ";
    std::cin >> x;
    std::cout << "Введіть координату y: ";
    std::cin >> y;

    // Перевірка істинності висловлювання
    bool isInFirstOrThirdQuadrant = (x > 0 && y > 0) || (x < 0 && y < 0);

    // Вивід результату
    std::cout << "Точка з координатами (" << x << ", " << y << ") "
              << (isInFirstOrThirdQuadrant ? "лежить в першій або третій координатній чверті. true (1)" : "не лежить в першій або третій координатній чверті. false (0)") << std::endl;


    // Оголошення змінної x1
    double x1;

    // Ввід значення x від користувача
    std::cout << "Введіть значення x1: ";
    std::cin >> x1;

    // Обчислення виразу за заданою формулою
    double y1 = (4 * M_PI * pow(sin(4 * M_PI + x1), 2) * pow(pow(fabs(x1 - 0.5 * exp(x1)), 3), 0.5))
               / (pow(3, x1 - 1) * log(sin(37 * M_PI / 180))); // Кут в sin та log має бути в радіанах

    // Вивід результату
    std::cout << "Результат обчислення виразу: " << y1 << std::endl;



    return 0;
    
    
    
}
